# Задача 2. Поменять местами
# Вы уже умеете менять местами строковые переменные и знаете, что в них также можно хранить числа.

# Напишите программу, которая меняет значения двух переменных местами. Использовать третью переменную и «синтаксический сахар» (конструкция a, b = b, a) нельзя. В переменные будут вводиться только числа.

# Скопируйте этот код и вставьте в редактор Replit, чтобы решить задачу. Не меняйте уже написанный код (input и print).
# Можете вставить между принтами любое количество строк кода, которое вам нужно для решения

a = int(input('Введите первое число: '))
b = int(input('Введите второе число: '))
print(a, b)
# Здесь вы можете написать любое количество строк кода. Менять, удалять, переставлять строки выше и ниже — нельзя.
print(a, b)

# На что обратить внимание
# Нельзя использовать «синтаксический сахар» и третью переменную.
# Нельзя менять вывод.
# Чтобы посмотреть подсказку, нажмите на кнопку ниже.

# Подсказка к задаче 2
# Посмотрим на код, который был дан в условии. Он реализуется следующим образом:

# программа запрашивает у пользователя два числа и сохраняет их в переменные a и b;
# программа выводит первоначальные значения этих переменных.
# Чтобы поменять значения переменных местами, не используя третью переменную и «синтаксический сахар», можно выполнить арифметические операции.

# Сложение. 
# Сложите значения переменных a и b и сохраните результат в переменную a.
# Вычитание для изменения значения b. 
# Отнимите новое значение b от a и сохраните результат в b.
# Вычитание для изменения значения a. 
# Отнимите новое значение b от a и сохраните результат в a.
# Теперь осталось вывести результат на экран с помощью команды print, которая уже есть в данном для задачи коде.

# Попробуйте решить эту задачу самостоятельно. Не переживайте, если не получится сделать это с первого раза.

# Когда будете готовы, переходите к следующему материалу, в котором эксперт разобрал задания этой практики и подготовил новую тему.

# Приятного пользования!        