print("Задача 8. Максимальное число (по желанию)")
print("Здравствуйте дорогой посетитель!", "\n", "Рад предложить вашему вниманию.", sep="")
in_num_1 = int(input("Введите 1-ое число: "))
in_num_2 = int(input("Введите 2-ое число: "))
in_num_3 = int(input("Введите 3-ое число: "))
in_num_4 = int(input("Введите 4-ое число: "))
print(max(in_num_1, in_num_2, in_num_3, in_num_4))

# Пользователь вводит три числа.
# Напишите программу,
# которая выводит на экран максимальное из этих трёх чисел (все числа разные).
# Можно использовать дополнительные переменные, если нужно
