scores = 269
medal = 1

if scores > 280 and medal == 1:
    print("Поздравляем! Ты поступил!")
else:
    print("К сожалению, ты не прошёл в наш университет.")

# Как поступить?
# Илья хочет в лучший вуз страны, а для этого нужно не только хорошо сдать экзамены (балл должен быть больше 280), но и иметь золотую медаль.

# Напишите программу, которая считывает из переменных scores, medal два числа: результат экзаменов и наличие золотой медали (0 — нет медали, 1 — медаль есть), а затем проверяет, поступил ли Илья в вуз.

# Выведите соответствующее сообщение:
# "Поздравляем! Ты поступил!" - если поступил.
# "К сожалению, ты не прошёл в наш университет." - если не поступил.

# Пример:
# На входе:

# scores = 290
# medal = 1
# На выходе:

# Поздравляем! Ты поступил!
# Пример 2:
# На входе:

# scores = 269