temperature = 110

if temperature < 0 or temperature > 100:
    print("Опасность!")
else:
    print("Температура в пределах нормы")

# Бактерии живут комфортно
# Биолог Арсений изучает микробы и их поведение при разных температурных нагрузках. Он помещает их в специальную среду, где температура скачет в промежутке от 0 до 100 градусов.
# Если же температура в среде выходит за рамки промежутка, то выводится предупреждение.

# Напишите программу, которая считывает из переменной temperature температуру, и, если она меньше нуля или больше 100, то выводится сообщение об опасности "Опасность!"
# иначе выводится "Температура в пределах нормы".

# Пример:
# На входе:

# temperature = 110
# На выходе:

# Опасность!