# Практика
# Задача 1. Квадраты превратились в кубы
# Напишите программу, которая выводит кубы чисел (число в третьей степени), лежащих в диапазоне от 1 до 10.
print('Задача 1. Квадраты превратились в кубы')
for number in range(1, 11):
    print(number ** 3)